app/controllers/bikes_controller.rb

    def index
        @bikes = Bike.all
---
SELECT "bikes".* FROM "bikes"