app/controllers/registrations_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "street", "city", "state", "zip_code", "latitude", "longitude", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
    def create
        user = User.create!(
            first_name: params['user']['first_name'],
            last_name: params['user']['last_name'],
            email: params['user']['email'],
            password: params['user']['password'],
            password_confirmation: params['user']['password_confirmation'],
            address: params['user']['address'],
            city: params['user']['city'],
            state: params['user']['state'],
            zip_code: params['user']['zip_code'],
            phone_number: params['user']['phone_number']

        )