app/controllers/static_controller.rb

    def home
        users = User.all
        user_bikes = Bike.all
---
SELECT "users".* FROM "users"
SELECT "bikes".* FROM "bikes"